Catalogs/Тара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Тара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Преф</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Тара/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Создать(Команда)
	Для Ш=НомС По НомПо Цикл
		СтрНом=Строка(Ш) ;
		Если СтрДлина(СтрНом)>3 Тогда
			Если СтрДлина(СтрНом)>7 Тогда 
				
			Иначе
				СтрНом=Лев(СтрНом, СтрДлина(СтрНом)-4)+Прав(СтрНом,3);
			КонецЕсли;   
		Иначе
			
		КонецЕсли;	
		Пока СтрДлина(СтрНом)<>10 Цикл
			СтрНом="0"+СтрНом;
		КонецЦикла;
		Спр=Справочники.Тара.НайтиПоКоду(СтрНом);
		Если ЗначениеЗаполнено(Спр) тогда
		Иначе
			Спр=Справочники.Тара.СоздатьЭлемент();
			Спр.Код=СтрНом;
			Спр.Преф=Преф;
			Спр.ШК=Преф+СтрНом;
			Спр.Наименование=ИмяОб+" № " +Ш;
			Спр.Записать();
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Печатать(Команда)
	
	масСтрок=Элементы.Список.ВыделенныеСтроки;
	
	
	//Для Каждого эл_масСтрок Из масСтрок Цикл
	//	ШК= эл_масСтрок.Штрихкод;
	//	ФИО=эл_масСтрок.Наименование;
	//	//Сообщить(эл_масСтрок.Штрихкод);	
	//	
	//КонецЦикла;
	
	Если масСтрок.Количество()=0 Тогда
		Сообщить("Ничего не Выбрано.");
		Возврат;	
	КонецЕсли;
	
	//Попытка
		ТабличныйДокумент = ПечатнаяФорма(масСтрок);
	//Исключение
	//КонецПопытки;
	
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.Показать();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция  ПечатнаяФорма(масСтрок) 
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	
	//Макет = Обработки.ПроизвольнаяПечатьШК.ПолучитьМакет("Макет");
	Макет=Справочники.Тара.ПолучитьМакет("Макет");
	Область1 = Макет.ПолучитьОбласть("Шапка");
	
	Для Каждого эл_масСтрок Из масСтрок Цикл
		Если эл_масСтрок.ЭтоГруппа Тогда
			Продолжить;	
		КонецЕсли;
		Для Ш=1 по 4 Цикл 
			ШК=эл_масСтрок.ШК;
			ФИО=эл_масСтрок.Наименование;
			Область1.Параметры.ПроизвольныйТекст = ФИО;
			КартинкаШтрихкода = ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(ШК, 100, 90);
			Рисунок = Область1.Область("ШК1");
			Рисунок.Картинка = КартинкаШтрихкода;
			ТабличныйДокумент.Вывести(Область1);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;	
	КонецЦикла;
	Возврат ТабличныйДокумент;
КонецФункции
